## SQLite и Pandas

Сегодня мы поработаем над тем как извлекать данные из базы данных SQLite. Для начала импортируем нужные нам библиотечки.

In [4]:
import sqlite3
import pandas as pd

Напоминаю, что "библиотека" в питоне -- это просто .py-файлики, содержащие наборы функций и объектов, которые можно просто извлекать и использовать. 

Импортировав две библиотеки выше мы добавили их в нашу рабочую среду и теперь они готовы к использованию. 

Вы можете написать свои библиотеки для конкретных повторяющихся задач. Иногда это удобно. Иногда нет.

In [5]:
# Создаем коннектор к файлу нашей базы данных. 
# Само собой, файлик Базы Данных должен лежать рядом с файлом блокнота (который вы сейчас читаете). 
con = sqlite3.connect('DBname.db')

In [6]:
# Не спрашивайте
cur = con.cursor()

In [9]:
# Таким образом исполняется запрос к Базе Данных. 
# Здесь Python передает предложение SELECT в СУБД (в данном случае это библиотечка sqlite3) и выполняет его, а возвращает набор данных из таблицы (результат работы SELECT)

cur.execute('SELECT * FROM EmployeePoints').fetchall()

[('Маша', 5, '2020-01-01'),
 ('Петя', 4, '2020-01-01'),
 ('Вася', 3, '2020-01-01'),
 ('Саша', 4, '2020-01-01'),
 ('Маша', 4, '2020-01-02'),
 ('Петя', 4, '2020-01-02'),
 ('Вася', 4, '2020-01-02'),
 ('Саша', 5, '2020-01-02'),
 ('Маша', 5, '2020-01-03'),
 ('Петя', 3, '2020-01-03'),
 ('Вася', 2, '2020-01-03'),
 ('Саша', 5, '2020-01-03'),
 ('Маша', 3, '2020-01-04'),
 ('Петя', 3, '2020-01-04'),
 ('Вася', 3, '2020-01-04'),
 ('Саша', 3, '2020-01-04'),
 ('Максим', 2, '2020-01-04'),
 ('Маша', 5, '2020-01-05'),
 ('Петя', 3, '2020-01-05'),
 ('Вася', 3, '2020-01-05'),
 ('Саша', 3, '2020-01-05')]

In [14]:
cur.execute('SELECT DISTINCT EMPLOYEE FROM EmployeePoints ').fetchall()

[('Маша',), ('Петя',), ('Вася',), ('Саша',), ('Максим',)]

In [15]:
# Можно выполнять и более сложные селекты

cur.execute("""

SELECT Employee, count(Point) from EmployeePoints
where point=5
group by Employee
Order by count(point) desc;

""").fetchall()

[('Маша', 3), ('Саша', 2)]

# Pandas

В Пандасе есть встроенный метод read_sql для исполнения SQL-запросов. И он неплохо работает с SQLite.

Обратите внимание на то, как мы передаем в него коннектор (объект con) для подключения к Базе Данных. 

Выражение 'df =' означает, что результат работы метода read_sql мы складываем в уже пандасовский объект с названием df.

In [16]:
df = pd.read_sql("""

SELECT DISTINCT EMPLOYEE FROM EmployeePoints

""", con)

Мы извлекли из БД таблицу и сложили ее в пандас-датафрейм df (это уже объект в Python).

Далее можем работать с ним как пожелаем.

In [17]:
df

  Employee
0     Маша
1     Петя
2     Вася
3     Саша
4   Максим

In [18]:
df = pd.read_sql("""

SELECT Employee, count(Point) from EmployeePoints
where point=5
group by Employee
Order by count(point) desc;

""", con)

In [19]:
df

  Employee  count(Point)
0     Маша             3
1     Саша             2

Почитать: https://medium.com/@bigdataschool/%D0%B8%D0%BD%D1%82%D0%B5%D0%B3%D1%80%D0%B0%D1%86%D0%B8%D1%8F-sqlite-%D0%B8-pandas-456d813462c5